# <== PACKAGES ==> #
brew "boost"
brew "cryptopp"
brew "clang-format"
brew "cppcheck"
brew "cryptopp"
brew "libsodium"
brew "llvm"
brew "make"
brew "nlohmann-json"
brew "sqlite"
brew "sqlitecpp"
brew "termcolor"
brew "zlib"
# <== ==> #

# <== VSC EXTENSIONS ==> #
vscode "ms-vscode.cpptools"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "vadimcn.vscode-lldb"
vscode "ms-vscode.makefile-tools"
# <== ==> #